spec/fixtures/vcr_cassettes/service_gateway_paymill_pay_discount.yml

---
http_interactions:
- request:
    method: post
    uri: https://a304f4f8844b61d80a399f8dd3ec561f:@api.paymill.com/v2/payments
    body:
      encoding: US-ASCII
      string: token=tok_053f96c375bd24bb00a2
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 14 Mar 2015 17:46:26 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Strict-Transport-Security:
      - max-age=16070400; includeSubDomains
    body:
      encoding: UTF-8
      string: "{\n\t\"data\":{\n\t\t\"id\":\"pay_e2ac1eb8ab4b93b9c5d17f6a\",\n\t\t\"type\":\"creditcard\",\n\t\t\"client\":null,\n\t\t\"card_type\":\"visa\",\n\t\t\"country\":\"DE\",\n\t\t\"bin\":\"411111\",\n\t\t\"expire_month\":\"2\",\n\t\t\"expire_year\":\"2020\",\n\t\t\"card_holder\":\"\",\n\t\t\"last4\":\"1111\",\n\t\t\"updated_at\":1426355143,\n\t\t\"created_at\":1426355143,\n\t\t\"app_id\":null,\n\t\t\"is_recurring\":true,\n\t\t\"is_usable_for_preauthorization\":true\n\t},\n\t\"mode\":\"test\"\n}"
    http_version: 
  recorded_at: Sat, 14 Mar 2015 17:46:25 GMT
- request:
    method: post
    uri: https://a304f4f8844b61d80a399f8dd3ec561f:@api.paymill.com/v2/transactions
    body:
      encoding: US-ASCII
      string: amount=5000&currency=USD&payment=pay_e2ac1eb8ab4b93b9c5d17f6a
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 14 Mar 2015 17:46:27 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Strict-Transport-Security:
      - max-age=16070400; includeSubDomains
    body:
      encoding: UTF-8
      string: "{\n\t\"data\":{\n\t\t\"id\":\"tran_4ea9b43255b20a0826d2007a14b0\",\n\t\t\"amount\":\"5000\",\n\t\t\"origin_amount\":5000,\n\t\t\"status\":\"closed\",\n\t\t\"description\":null,\n\t\t\"livemode\":false,\n\t\t\"refunds\":null,\n\t\t\"client\":{\n\t\t\t\"id\":\"client_414b35a3d7d8095434a0\",\n\t\t\t\"email\":null,\n\t\t\t\"description\":null,\n\t\t\t\"app_id\":null,\n\t\t\t\"updated_at\":1426355187,\n\t\t\t\"created_at\":1426355187,\n\t\t\t\"payment\":[\n\t\t\t\t\"pay_e2ac1eb8ab4b93b9c5d17f6a\"\n\t\t\t],\n\t\t\t\"subscription\":null\n\t\t},\n\t\t\"currency\":\"USD\",\n\t\t\"created_at\":1426355187,\n\t\t\"updated_at\":1426355187,\n\t\t\"response_code\":20000,\n\t\t\"short_id\":\"7357.7357.7357\",\n\t\t\"is_fraud\":false,\n\t\t\"invoices\":[\n\n\t\t],\n\t\t\"app_id\":null,\n\t\t\"preauthorization\":null,\n\t\t\"fees\":[\n\n\t\t],\n\t\t\"payment\":{\n\t\t\t\"id\":\"pay_e2ac1eb8ab4b93b9c5d17f6a\",\n\t\t\t\"type\":\"creditcard\",\n\t\t\t\"client\":\"client_414b35a3d7d8095434a0\",\n\t\t\t\"card_type\":\"visa\",\n\t\t\t\"country\":\"DE\",\n\t\t\t\"bin\":\"411111\",\n\t\t\t\"expire_month\":\"2\",\n\t\t\t\"expire_year\":\"2020\",\n\t\t\t\"card_holder\":\"\",\n\t\t\t\"last4\":\"1111\",\n\t\t\t\"updated_at\":1426355187,\n\t\t\t\"created_at\":1426355143,\n\t\t\t\"app_id\":null,\n\t\t\t\"is_recurring\":true,\n\t\t\t\"is_usable_for_preauthorization\":true\n\t\t},\n\t\t\"is_refundable\":true,\n\t\t\"is_markable_as_fraud\":true\n\t},\n\t\"mode\":\"test\"\n}"
    http_version: 
  recorded_at: Sat, 14 Mar 2015 17:46:26 GMT
recorded_with: VCR 2.9.3
